{
  "역마살": {
    "desc": "한 곳에 머물면 몸이 아프거나 일이 꼬이는 '이동의 기운'이네. 끊임없이 움직여야 생기가 도는 운명이지.",
    "risk": "직장 변동이 잦거나, 타향살이의 외로움을 느낄 수 있네. 교통사고나 낙상 등 이동 중의 사고수를 조심해야 하네.",
    "action": "가만히 있지 말고 몸을 움직이게. 영업, 무역, 운수업처럼 돌아다니는 일을 하거나, 주말마다 여행을 떠나 '이동수'를 액땜해야 하네.",
    "remedy": "운동화, 자동차, 비행기 티켓이 그대의 부적이네. 집안에서는 가구 배치를 자주 바꾸는 것도 도움이 되네."
  },
  "도화살": {
    "desc": "가만히 있어도 벌나비가 꼬이는 '매력과 인기의 기운'이네. 사람을 끌어당기는 힘이 강하여 주목받는 삶을 살게 되네.",
    "risk": "구설수(입방아)에 오르거나, 원치 않는 이성 문제로 골머리를 앓을 수 있네. 주색잡기에 빠지면 패가망신할 수도 있네.",
    "action": "그대의 끼를 숨기지 말고 직업(방송, 영업, 홍보, 예술)으로 풀어내게. 남에게 보여지는 일이 아니라면, 취미로라도 무대에서는 것이 좋네.",
    "remedy": "화려한 장신구, 거울, 조명, 향수를 가까이 하게. 자신을 꾸미는 것이 곧 개운법일세."
  },
  "화개살": {
    "desc": "화려함을 덮고 창고에 들어가는 '고독과 예술의 기운'이네. 종교, 철학, 예술 등 정신적인 세계에 깊은 인연이 있네.",
    "risk": "군중 속의 고독을 느끼거나, 현실 감각을 잃고 종교나 철학적 심연에 빠져 고립될 수 있네. 과거의 인연이나 일에 얽매이기 쉽네.",
    "action": "혼자 있는 시간을 두려워 말고, 글을 쓰거나 연구를 하여 그대만의 정신 세계를 구축하게. 그것이 훗날 큰 명예가 될 것이네.",
    "remedy": "책, 도서관, 사찰/교회, 명상, 흙(도자기)을 만지는 취미."
  },
  "현침살": {
    "desc": "바늘처럼 뾰족한 것으로 찌르는 '예리한 기술의 기운'이네. 남들이 보지 못하는 것을 꿰뚫어 보는 통찰력이 있네.",
    "risk": "말이 칼이 되어 남에게 상처를 주거나, 본인이 신경성 질환(두통, 불면)에 시달릴 수 있네. 예민함이 과해지면 히스테리가 될 수 있네.",
    "action": "의료, 미용, IT, 요리, 타투처럼 뾰족한 도구를 쓰는 전문 기술을 익히게. 남을 살리거나 고치는 활인업(活人業)을 하면 흉이 복이 되네.",
    "remedy": "침, 주사기, 펜, 가위, 바늘 등 뾰족한 도구를 다루는 취미(자수, 조각)."
  },
  "자형살": {
    "desc": "스스로를 볶아대며 완벽을 추구하는 '자기 형벌의 기운'이네. (오-오, 진-진, 해-해, 유-유 자형)",
    "risk": "남들은 괜찮다는데 본인이 만족하지 못해 극심한 스트레스를 받고, 예민함이 극에 달해 우울증이나 강박증이 올 수 있네.",
    "action": "자신을 너무 몰아세우지 말게. '이 정도면 됐다'라고 타협하는 연습이 필요하네. 그 집요함을 창작이나 연구로 승화시키게.",
    "remedy": "산책, 멍때리기, 따뜻한 차, 명상 음악. 나를 놓아주는 시간이 필요하네."
  },
  "귀문관살": {
    "desc": "귀신이 문을 드나들듯 '천재적인 영감과 엉뚱함'이 공존하네. 남다른 직관력과 예술성을 지녔으나 정신적으로 불안정할 수 있네.",
    "risk": "직감이 너무 뛰어나 남의 속을 꿰뚫어 보니 피곤하고, 신경쇠약, 의처증/의부증, 혹은 빙의 같은 영적 현상을 겪을 수도 있네.",
    "action": "그대의 예민함은 재능이니, 예술이나 상담, 기획 분야에 쏟아붓게. 일반적인 직장 생활보다는 전문직이나 프리랜서가 어울리네.",
    "remedy": "반신욕, 향초, 정신과/심리 상담, 종교 생활."
  },
  "백호살": {
    "desc": "흰 호랑이의 기세와 같은 '강력한 에너지와 투쟁심'이네. 평소엔 조용하다가도 한번 화가 나면 폭발적인 힘을 발휘하네.",
    "risk": "혈광사(피를 보는 일)나 사고수가 따를 수 있으며, 가족 간에 불화가 생기거나 수술을 할 수도 있네.",
    "action": "그 강력한 에너지를 억누르지 말고 운동이나 경쟁적인 일로 풀어내게. 군인, 경찰, 운동선수, 외과의사 등 '피를 보는 직업'이 천직일세.",
    "remedy": "헌혈, 봉사활동, 격렬한 운동."
  },
  "괴강살": {
    "desc": "북두칠성의 으뜸 별처럼 '우두머리가 되려는 강력한 리더십'이네. 남에게 굽히기 싫어하고 총명하며 결단력이 대단하네.",
    "risk": "독선적이고 고집이 세서 적을 만들 수 있으며, 부부 사이가 원만하지 못할 수 있네. 극과 극의 인생을 살기 쉽네.",
    "action": "자신의 주장을 조금만 굽히고 타인의 의견을 경청하게. 리더가 되더라도 독단보다는 포용력을 보여야 롱런할 수 있네.",
    "remedy": "독서, 명상, 리더십 교육, 타인을 위한 봉사."
  },
  "원진살": {
    "desc": "서로 미워하고 원망하는 '애증의 기운'이네. 이유 없이 상대방이 미워지거나, 붙어 있으면 싸우고 떨어지면 보고 싶은 묘한 관계네.",
    "risk": "부부나 연인 사이에 오해와 갈등이 끊이지 않고, 대인관계에서 억울한 누명을 쓰거나 배신을 당할 수 있네.",
    "action": "상대방에 대한 기대를 낮추고, 적당한 거리두기를 실천하게. 너무 가까이 붙어있는 것보다는 주말부부나 각자의 생활을 존중하는 것이 좋네.",
    "remedy": "각방 쓰기, 취미 생활 공유하지 않기, 서로 존댓말 쓰기."
  },
  "공망": {
    "desc": "밑 빠진 독처럼 '채워도 채워지지 않는 헛헛함'이네. 노력에 비해 결과가 적거나, 현실성 없는 꿈을 꿀 수 있네.",
    "risk": "일을 벌여놓고 마무리를 못 하거나, 사기를 당해 재물을 잃을 수 있네. 현실 도피적인 성향이 나타날 수 있네.",
    "action": "결과에 연연하기보다는 과정 자체를 즐기거나, 종교/철학/예술 등 비현실적인(정신적인) 분야에 몰입하면 오히려 대성하네.",
    "remedy": "기부, 봉사, 종교 생활, 욕심 버리기."
  },
  "재다신약": {
    "desc": "재물(일거리/여자)은 산더미인데 내 힘이 약해 짊어지지 못하는 형국이네. 부자 사주라 하지만 정작 내 지갑은 비어있을 수 있네.",
    "risk": "돈을 쫓으면 몸이 아프거나, 돈은 들어오는데 쥐고 있지를 못하고 줄줄 새어나가네. 남자라면 여자 문제로 고생할 수 있네.",
    "action": "절대 혼자 사업하지 말게. 내 힘이 되어줄 동료(비겁)와 함께하거나, 자격증(인성)을 따서 내 몸값을 높이는 것이 돈을 버는 유일한 길이네.",
    "remedy": "공부, 자격증 취득, 믿을만한 파트너와 동업, 부동산(문서)으로 재산 묶어두기."
  },
  "관살혼잡": {
    "desc": "나를 통제하는 직장이나 남자가 너무 많은 형국이네. 여기저기서 나를 찾으니 인기는 많으나, 정작 나는 피곤하고 실속이 없네.",
    "risk": "직장 변동이 잦거나, 남자 문제로 인해 구설수에 오를 수 있네. 과로로 인한 건강 악화나 스트레스를 조심해야 하네.",
    "action": "한 가지 일에 집중하고, 거절하는 법을 배워야 하네. 나만의 확실한 전문 기술을 가지면 그 많은 관살(일거리)이 다 내 명예가 되네.",
    "remedy": "규칙적인 생활, 운동, 한 우물 파기, 나쁜 남자(여자) 조심하기."
  },
  "식상과다": {
    "desc": "표현하고 싶은 욕구가 넘쳐흐르는 형국이네. 말재주가 좋고 재능이 많으나, 입이 가벼워 화를 부를 수 있네.",
    "risk": "조직 생활에 적응하기 힘들고, 윗사람과 마찰을 빚을 수 있네. 벌리는 일은 많으나 마무리가 안 될 수 있네.",
    "action": "그 넘치는 에너지를 말보다는 창작, 예술, 기술로 풀어내게. 프리랜서나 전문직, 혹은 유튜버처럼 자기를 드러내는 일이 천직이네.",
    "remedy": "침묵 수행, 글쓰기, 전문 자격증 취득."
  },
  "인성과다": {
    "desc": "생각이 너무 많아 실행력이 떨어지는 형국이네. 어머니의 간섭이 심하거나, 의존적인 성향이 나타날 수 있네.",
    "risk": "게을러지기 쉽고, 현실 감각이 떨어져 몽상에 빠질 수 있네. 결정 장애로 인해 좋은 기회를 놓칠 수 있네.",
    "action": "생각은 그만하고 일단 저지르게. 몸을 쓰는 운동을 하거나, 재테크 등 현실적인 활동을 통해 '재극인(현실 감각 깨우기)'을 해야 하네.",
    "remedy": "운동, 여행, 경제 활동, 부모로부터 독립."
  },
  "비겁과다": {
    "desc": "나와 같은 경쟁자가 너무 많은 형국이네. 자존심과 고집이 세고, 재물을 두고 다투는 일이 잦을 수 있네.",
    "risk": "돈 거래로 인해 사람을 잃거나, 배우자와의 사이가 나빠질 수 있네. 독불장군이 되어 고립될 수 있네.",
    "action": "내 것을 나누어 주는 기부와 봉사를 생활화하게. 동업은 피하고, 나의 전문성을 키워 독보적인 위치에 올라야 경쟁에서 이기네.",
    "remedy": "기부, 더치페이 생활화, 개인 사업보다는 전문직."
  }
}