{
  "meta": {
    "desc": "사주 패턴에 따른 신체 증상, 주거 환경, 행동 습관 매핑 데이터",
    "usage": "사용자가 별다른 말을 하지 않아도 먼저 맞추는 '콜드 리딩' 용도"
  },
  "patterns": {
    "습한_사주(Wet_Chart)": {
      "condition": "사주에 수(Water)가 많거나, 축(丑)/해(亥)/자(子) 월생인 경우",
      "environment": "집안에 습기가 많아 곰팡이가 잘 슬거나, 화장실/배수구 쪽에 누수가 있었던 집. 햇빛이 잘 안 드는 북향이나 반지하 경험.",
      "body": "몸이 잘 붓고(부종), 손발이 차며(수족냉증), 비가 오면 관절이 쑤심. 신장/방광 쪽이 약함.",
      "habit": "밤에 활동하는 것을 좋아하고, 혼자 술 마시는 것을 즐김.",
      "shamanic_voice": "집터가 눅눅하구먼. 화장실이나 베란다 쪽에 물 새는 곳 없나 확인해보게. 자네 몸도 물 먹은 솜처럼 무겁지 않은가?"
    },
    "조열한_사주(Dry_Hot_Chart)": {
      "condition": "사주에 화(Fire)/토(Earth)가 많거나, 미(未)/오(午)/술(戌) 월생인 경우",
      "environment": "채광이 너무 좋아 여름에 찜통인 집. 주변에 네온사인이나 가로등이 있어 밤에도 밝은 곳. 전자제품이 유난히 많음.",
      "body": "피부가 건조하고 아토피나 알레르기가 있음. 안구 건조증, 불면증, 가슴이 답답한 증상.",
      "habit": "성격이 급해 밥을 빨리 먹음. 물을 자주 마시거나 찬 음료를 달고 삼.",
      "shamanic_voice": "속에 불덩이가 들어앉았어! 밤에 잠 안 와서 핸드폰만 들여다보지? 물 좀 많이 마시게. 속이 바짝바짝 타들어가네."
    },
    "현침살_중중(Needle_Stars)": {
      "condition": "사주 글자에 갑(甲), 신(辛), 묘(卯), 오(午), 신(申) 등 뾰족한 글자가 2개 이상일 때",
      "environment": "집안에 바느질 도구, 공구, 혹은 뾰족한 장식품(선인장 등)이 많음. 예민한 성격이라 소음에 민감함.",
      "body": "몸에 수술 자국이나 흉터가 있거나, 잘 체함. 신경성 위염.",
      "habit": "남의 말꼬리를 잘 잡거나, 분석하고 비판하는 것을 좋아함. 손재주가 좋아 조립이나 요리를 잘함.",
      "shamanic_voice": "자네, 말로 사람 뼈 때리는 재주가 있구만. 아니면 손에 가위나 주사기라도 들어야 직성이 풀리나? 남 가슴에 못 박는 소리 좀 그만하게."
    },
    "귀문관살_발동(Ghost_Gate)": {
      "condition": "일지-시지 혹은 일지-월지에 귀문(진해, 자유, 사술 등)이 형성될 때",
      "environment": "집안에 잡동사니가 많아 정리가 안 됨. 묘한 분위기의 그림이나 인형이 있음.",
      "body": "원인 모를 두통, 편두통, 가위눌림, 예민한 신경.",
      "habit": "한 가지에 꽂히면 무섭게 집착함. 남들은 못 느끼는 촉(직감)이 발달함. 혼잣말을 하거나 멍하니 있는 시간.",
      "shamanic_voice": "머리가 지끈거리지? 병원 가도 별 이상 없다고 할 걸세. 자네 촉이 너무 좋아서 남들이 못 보는 것까지 느껴서 그래. 신경 좀 끄고 살게."
    },
    "역마_과다(Excess_Mobility)": {
      "condition": "인(寅), 신(申), 사(巳), 해(亥) 글자가 3개 이상일 때",
      "environment": "도로변이나 역세권 등 시끄럽고 분주한 곳에 거주. 집에 가구 배치를 자주 바꾸거나 짐이 항상 싸여 있음.",
      "body": "교통사고 후유증, 다리나 허리를 잘 다침. 한자리에 오래 앉아 있으면 몸이 쑤심.",
      "habit": "쉬는 날 집에 붙어있지 못함. 운전이나 여행을 좋아함. 직업이나 알바를 자주 바꿈.",
      "shamanic_voice": "엉덩이에 뿔이 났나, 한시도 가만히 못 있구만! 집에 있으면 좀이 쑤시지? 차라리 밖으로 나가서 뛰게. 그래야 액땜이 돼."
    },
    "무관_사주(No_Official)": {
      "condition": "관성(Official Star)이 없는 경우 (무관 사주)",
      "environment": "자유분방한 인테리어. 정리정돈이 잘 안 되어 있거나 규칙이 없는 생활 공간.",
      "body": "통제받는 스트레스에 취약함. 척추나 관절이 약할 수 있음(자세를 바르게 하지 않아서).",
      "habit": "남 눈치 안 보고 마이웨이. 상사나 윗사람이 잔소리하면 바로 사표 던지고 싶어 함.",
      "shamanic_voice": "누가 이래라저래라 하는 거 질색이지? 자네는 목줄 풀린 강아지야. 억지로 틀에 가두면 병나니, 알아서 제 밥벌이 찾아야 해."
    }
  }
}